# Q1. List any five functions of the pandas library with execution.

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\sampada\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: numpy>=1.17.3 in c:\users\sampada\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\sampada\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\sampada\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\sampada\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd

**1. read_csv: Read data from a CSV file into a DataFrame.**

In [4]:
df =pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

**2. head: Display the first few rows of a DataFrame.**

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**3.  describe() function - This function is used to generate descriptive statistics for a DataFrame, such as count, mean, standard deviation, minimum, and maximum.**

In [6]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

**4. tail: Display the last few rows of a DataFrame.**

In [7]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

**5. info(): This function is used to print a summary of a DataFrame, including information about the data types, number of non-null values, and memory usage.**

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [9]:
data = {'A': [10, 20, 30],
        'B': [40, 50, 60],
        'C': [70, 80, 90]}

df = pd.DataFrame(data)

In [10]:
import pandas as pd

def reindex_dataframe(df):
    
    new_index = pd.Index(range(1, len(df) * 2, 2), name='NewIndex')
    new_df = pd.DataFrame(data=df.values, columns=df.columns, index=new_index)
    
    return new_df

new_df = reindex_dataframe(df)

print(new_df)

           A   B   C
NewIndex
1         10  40  70
3         20  50  80
5         30  60  90

# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [11]:
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
df

   Values
0      10
1      20
2      30
3      40
4      50

In [12]:
def calculate_sum_of_first_three(df):
    
    sum_of_first_three = df['Values'].iloc[:3].sum()
    print(f"Sum of the first three values: {sum_of_first_three}")
    
a=calculate_sum_of_first_three(df)
a

Sum of the first three values: 60

# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
data1= {'a':("Statistics is the discipline that concerns the collection, organization, analysis, interpretation, and presentation of data. In applying statistics to a scientific, industrial, or social problem, it is conventional to begin with a statistical population or a statistical model to be studied. ","i am a leraner")}

d1=pd.DataFrame(data1)
d1

                                                   a
0  Statistics is the discipline that concerns the...
1                                     i am a leraner

In [14]:
def add_word_count_column(df):
   
    def count_words(text):
        return len(text.split())

    
    d1['Word_Count'] = d1['a'].apply(count_words)

   
    return d1
print(d1)

                                                   a
0  Statistics is the discipline that concerns the...
1                                     i am a leraner

In [15]:
add_word_count_column(d1)

                                                   a  Word_Count
0  Statistics is the discipline that concerns the...          41
1                                     i am a leraner           4

# Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size:**

DataFrame.size returns the total number of elements (cells) in the DataFrame, which is equal to the product of the number of rows and the number of columns.

It returns a single integer value representing the size of the entire DataFrame.

**DataFrame.shape:**

DataFrame.shape returns a tuple representing the dimensions of the DataFrame, where the first element of the tuple is the number of rows, and the second element is the number of columns.

It provides a way to access the number of rows and columns separately.

In [16]:
df

   Values
0      10
1      20
2      30
3      40
4      50

In [17]:
df.size

5

In [18]:
df.shape

(5, 1)

# Q6. Which function of pandas do we use to read an excel file?

To read an Excel file in pandas, we can use the pandas.read_excel() function. This function allows us to read data from Excel files (both .xls and .xlsx formats) into a pandas DataFrame.

In [19]:

# df = pd.read_excel('file name.xlsx', sheet_name=0)

# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [20]:

data = {'Email': ['ram@example.com', 'shyam2@domain.com', 'yash@example.net']}
df5 = pd.DataFrame(data)
df5

               Email
0    ram@example.com
1  shyam2@domain.com
2   yash@example.net

In [21]:
def extract_username(email):
    username = email.split('@')[0]
    return username

df5['Username'] = df5['Email'].apply(extract_username)

In [22]:
print(df5)

               Email Username
0    ram@example.com      ram
1  shyam2@domain.com   shyam2
2   yash@example.net     yash

# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [23]:
data = {'A': [6, 4, 7, 8, 3],
        'B': [9, 7, 5, 2, 12],
        'C': [12, 8, 10, 15, 6]}
df7 = pd.DataFrame(data)
df7

   A   B   C
0  6   9  12
1  4   7   8
2  7   5  10
3  8   2  15
4  3  12   6

In [24]:
def select_rows(df7):
    selected_rows = df7[(df7['A'] > 5) & (df7['B'] < 10)]
    return selected_rows

selected_df7 = select_rows(df7)

print(selected_df7)

   A  B   C
0  6  9  12
2  7  5  10
3  8  2  15

# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [25]:
data2 = {'values': [27, 36, 18, 45, 90,72]}
df9 = pd.DataFrame(data2)
df9

   values
0      27
1      36
2      18
3      45
4      90
5      72

In [26]:
def calculation(df):
    mean1= df9['values'].mean()
    median1= df9['values'].median()
    std_dev1= df9['values'].std()
    
    return mean1, median1, std_dev1

mean, median,std=calculation(df9)
print(f"Mean: {mean}")
print(f"Median: {median}")
print(f"Standard Deviation: {std}")

Mean: 48.0
Median: 40.5
Standard Deviation: 27.691153822114384

# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [27]:
data10={'date':pd.date_range(start='2023-09-01',periods=12,freq='D'),
       'Sales':[20,19,23,36,25,29,22,23,78,66,42,27]}
data11=pd.DataFrame(data10)
data11

         date  Sales
0  2023-09-01     20
1  2023-09-02     19
2  2023-09-03     23
3  2023-09-04     36
4  2023-09-05     25
5  2023-09-06     29
6  2023-09-07     22
7  2023-09-08     23
8  2023-09-09     78
9  2023-09-10     66
10 2023-09-11     42
11 2023-09-12     27

In [28]:
def moving_average(df):
    
        df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
        return df

In [29]:
data12= moving_average(data11)
print(data12)

         date  Sales  MovingAverage
0  2023-09-01     20      20.000000
1  2023-09-02     19      19.500000
2  2023-09-03     23      20.666667
3  2023-09-04     36      24.500000
4  2023-09-05     25      24.600000
5  2023-09-06     29      25.333333
6  2023-09-07     22      24.857143
7  2023-09-08     23      25.285714
8  2023-09-09     78      33.714286
9  2023-09-10     66      39.857143
10 2023-09-11     42      40.714286
11 2023-09-12     27      41.000000

# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [44]:
data12 = {'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06']}
data13=pd.DataFrame(data12)
data13

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

In [45]:
def weekday(df):
    df['Date']=pd.to_datetime(df['Date'])
    
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [46]:
data14= weekday(data13)
print(data14)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday
5 2023-01-06     Friday

# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [47]:
data16 = {'Date': ['2023-01-05', '2023-01-15', '2023-02-10', '2023-03-25','2023-01-22','2023-04-05','2023-01-31']}
data17 = pd.DataFrame(data16)
data17

         Date
0  2023-01-05
1  2023-01-15
2  2023-02-10
3  2023-03-25
4  2023-01-22
5  2023-04-05
6  2023-01-31

In [49]:
def row_selection(df):
    df['Date']=pd.to_datetime(df['Date'])
    
    selected_rows=  df[df['Date'].between('2023-01-01','2023-01-31')]
    return selected_rows

In [50]:
row_selection(data17)

        Date
0 2023-01-05
1 2023-01-15
4 2023-01-22
6 2023-01-31

# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

To use the basic functions of pandas, the necessary library that needs to be imported is -"pandas". We can import it in Python using the following convention, which is commonly used:

In [30]:
import pandas as pd